Revit 2026 API

# TileTextureRealWorldOffsetX Property

---

The property labeled "Offset X" from the "Tile" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TextureRealWorldOffsetX { get; }
```
```vb
Public Shared ReadOnly Property TextureRealWorldOffsetX As String
	Get
```
```cpp
public:
static property String^ TextureRealWorldOffsetX {
	String^ get ();
}
```
```fsharp
static member TextureRealWorldOffsetX : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDistance".

#### Reference

Tile Class

Autodesk.Revit.DB.Visual Namespace